In [1]:
import pandas as pd

In [2]:
employee = pd.DataFrame({
    'id' : [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
})

In [3]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [4]:
department = pd.DataFrame({
    'id': [1, 2],
    'name': ['IT', 'Sales']
})

In [5]:
department

   id   name
0   1     IT
1   2  Sales

In [8]:
df = employee.merge(department, how= 'inner', left_on= 'departmentId', right_on= 'id', suffixes= ('_e', '_d'))

In [13]:
df['rank'] = df.groupby(by= 'departmentId')['salary'].rank(method='dense', ascending= False)

In [16]:
df[df['rank'] == 1][['name_d', 'name_e', 'salary']].rename(columns= {'name_d': 'Department', 'name_e': 'Employee', 'salary': 'Salary'})

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000